owhinata/wio-lite-ai/app/rtl8720_flash.c
/*
 * SPDX-License-Identifier: MIT
 * Copyright (c) 2026 ThreadX Shell Project
 */
/*
 * RTL8720DN (AmebaD) on-device UART firmware-download support -- issue #19.
 * See rtl8720_flash.h for the entry mechanism, wiring and protocol references.
 *
 * Milestones, in the order they were proven on board #2: M1 download-mode entry,
 * M2 flashloader stub + flash read (non-destructive), M3 erase/write/verify on one
 * gated test sector, M4 capacity detection + full-chip backup (read-only), M5
 * rtl_dl_flash_program() -- the real thing, which erases and rewrites firmware
 * images including the boot sectors.  Everything destructive still funnels through
 * the two private primitives dl_erase_sectors() / dl_send_flash() and the single
 * range validator dl_flash_range_ok().
 *
 * M1 scope: prove UART download-mode ENTRY via a read-only handshake.  It performs
 * the strap+reset sequence (module OFF first, PD14 held low across the CHIP_EN rising
 * edge so the ROM samples the download strap, brief bounded hold, then PD14 released
 * to UART9_RX) and issues the download read-word command, checking for the framed
 * reply.  NO erase / NO write -- fully reversible, cannot brick (mask-ROM download is
 * re-enterable).  Register-agnostic beyond GPIO + the #17 rtl8720 primitives (never
 * touches the RCC clock tree) -> XIP-safe.  cli-agnostic (ThreadX timing + abort hook).
 */
#include "stm32h7xx_hal.h"   /* GPIO reconfig (PD14 strap: AF11 UART9_RX <-> output low) */
#include "tx_api.h"          /* tx_time_get / tx_thread_sleep (1 tick = 1 ms here) */
#include "rtl8720.h"         /* rtl8720_power/reset + UART9 open/close/read/write (#17) */
#include "rtl_link.h"        /* rtl_link_forget_module: a flash session voids every
                             * belief about the module, including its link rate */
#include "timebase.h"        /* udelay: DWT busy-wait for the bounded strap hold */
#include "rtl8720_flash.h"

#include <string.h>

/* PD14 = UART9_RX = RTL8720 PA[7]/UART_LOG_TXD = the UART_DOWNLOAD strap (active-low).
 * Held as a GPIO output low across the CHIP_EN edge, then returned to UART9_RX (AF11). */
#define RTL_DL_STRAP_PORT   GPIOD
#define RTL_DL_STRAP_PIN    GPIO_PIN_14

/* read-word (Program.cs ReadRegs): 0x31 + addr(u32 LE); reply 0x31 + data(u32 LE) + 0x15.
 * 0x00082000 is the flashloader load address; a framed reply here proves download entry
 * (and its data == 0x00082021 would mean the stub is already resident).  Read-only. */
#define RTL_DL_READ_WORD    0x31u
#define RTL_DL_STATUS_OK    0x15u
#define RTL_DL_PROBE_ADDR   0x00082000u

/* ------------------------------------------------------------------ *
 *  strap GPIO (PD14) + cancellable waits
 * ------------------------------------------------------------------ */

/* Drive PD14 as a push-pull output LOW (assert the download strap).  Only called while
 * the RTL8720 is powered off (PC3 low), so there is no contention with PA[7]. */
static void dl_strap_drive_low(void)
{
	GPIO_InitTypeDef io = {0};

	__HAL_RCC_GPIOD_CLK_ENABLE();
	HAL_GPIO_WritePin(RTL_DL_STRAP_PORT, RTL_DL_STRAP_PIN, GPIO_PIN_RESET); /* preset low */
	io.Pin   = RTL_DL_STRAP_PIN;
	io.Mode  = GPIO_MODE_OUTPUT_PP;
	io.Pull  = GPIO_NOPULL;
	io.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(RTL_DL_STRAP_PORT, &io);
	HAL_GPIO_WritePin(RTL_DL_STRAP_PORT, RTL_DL_STRAP_PIN, GPIO_PIN_RESET);
}

/* Return PD14 to a benign INPUT (pulled high, like idle UART RX).  This is the cleanup
 * guarantee: PD14 must never be left driven low, so it cannot fight the RTL8720 driving
 * PA[7] as its LOG-UART TX.  rtl8720_uart_open() later reconfigures it to AF11. */
static void dl_strap_release_input(void)
{
	GPIO_InitTypeDef io = {0};

	__HAL_RCC_GPIOD_CLK_ENABLE();
	io.Pin   = RTL_DL_STRAP_PIN;
	io.Mode  = GPIO_MODE_INPUT;
	io.Pull  = GPIO_PULLUP;
	io.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(RTL_DL_STRAP_PORT, &io);
}

/* Sleep @ms milliseconds, yielding; returns -1 if @should_abort fired, else 0. */
static int dl_wait_ms(uint32_t ms, int (*should_abort)(void *), void *ctx)
{
	ULONG deadline = tx_time_get() + (ULONG)ms;   /* 1 tick = 1 ms */

	while ((int32_t)(tx_time_get() - deadline) < 0) {
		if (should_abort != NULL && should_abort(ctx))
			return -1;
		tx_thread_sleep(1);
	}
	return 0;
}

/* Read whatever arrives (up to @cap) within @timeout_ms; returns the byte count, or
 * -2 if aborted.  A short read (timeout) is normal -- the caller parses what it got. */
static int dl_recv(uint8_t *buf, int cap, uint32_t timeout_ms,
                   int (*should_abort)(void *), void *ctx)
{
	ULONG deadline = tx_time_get() + (ULONG)timeout_ms;
	int n = 0;

	while (n < cap) {
		n += (int)rtl8720_uart_read(buf + n, (size_t)(cap - n));
		if (n >= cap)
			break;
		if (should_abort != NULL && should_abort(ctx))
			return -2;
		if ((int32_t)(tx_time_get() - deadline) >= 0)
			break;                        /* timeout: return what we have */
		tx_thread_sleep(1);
	}
	return n;
}

/* ------------------------------------------------------------------ *
 *  minimal SLIP (exploratory framing probe only -- pvvx uses raw)
 * ------------------------------------------------------------------ */

/* SLIP-encode @n bytes into @out (0xC0-delimited; 0xC0->DB DC, 0xDB->DB DD).
 * Returns the encoded length, or -1 if it would not fit @cap. */
static int slip_encode(const uint8_t *in, int n, uint8_t *out, int cap)
{
	int o = 0;
	int i;

	if (o >= cap) return -1;
	out[o++] = 0xC0u;
	for (i = 0; i < n; i++) {
		uint8_t b = in[i];
		if (b == 0xC0u) {
			if (o + 2 > cap) return -1;
			out[o++] = 0xDBu; out[o++] = 0xDCu;
		} else if (b == 0xDBu) {
			if (o + 2 > cap) return -1;
			out[o++] = 0xDBu; out[o++] = 0xDDu;
		} else {
			if (o >= cap) return -1;
			out[o++] = b;
		}
	}
	if (o >= cap) return -1;
	out[o++] = 0xC0u;
	return o;
}

/* SLIP-decode one frame out of @in into @out; returns the decoded length. */
static int slip_decode(const uint8_t *in, int n, uint8_t *out, int cap)
{
	int o = 0, i, started = 0, esc = 0;

	for (i = 0; i < n; i++) {
		uint8_t b = in[i];
		if (b == 0xC0u) {
			if (started && o > 0) break;  /* closing delimiter of a non-empty frame */
			started = 1;                  /* (re)start on the opening delimiter */
			continue;
		}
		if (!started)
			continue;
		if (esc) {
			b = (b == 0xDCu) ? 0xC0u : (b == 0xDDu) ? 0xDBu : b;
			esc = 0;
		} else if (b == 0xDBu) {
			esc = 1;
			continue;
		}
		if (o < cap)
			out[o++] = b;
	}
	return o;
}

/* ------------------------------------------------------------------ *
 *  public API
 * ------------------------------------------------------------------ */

int rtl_dl_enter(uint32_t hold_us, int (*should_abort)(void *), void *ctx)
{
	/*
	 * FORCE-QUIESCE FIRST, and it has to be first (issue #30 B2b).
	 *
	 * This used to be a bare rtl8720_uart_close() plus rtl_link_forget_module().  That
	 * was sound only while callers proved the link was idle before entering: the
	 * ownership rule in app/rtl8720.h lets this downloader open and close UART9 at will
	 * on the strength of rtl_link_uart_busy() == false, which the busy-reject claim
	 * established.  Since the L2 bridge became permanent the interface owner holds a
	 * reference for as long as the host stack is up, so callers now claim with
	 * allow_busy -- and a raw close would then be racing the link service thread, not
	 * just here but through every re-open the download protocol performs afterwards.
	 *
	 * rtl_link_force_quiesce() does the whole job under the eRPC lock: it drops the
	 * reference count to zero, advances BOTH generations (which is how the interface
	 * owner learns its link was taken away -- rtl_link_forget_module() alone never told
	 * it), abandons in-flight tokens and closes the UART.  Afterwards
	 * rtl_link_uart_busy() is false again, so the rest of this file is back on the
	 * footing its ownership contract assumes.  Caller holds the coarse mutex, which is
	 * exactly how force_quiesce is meant to be called.
	 *
	 * It also subsumes the old forget_module(): whatever the host believed about the
	 * module is void from here on -- this session exists to change that flash, it drives
	 * CHIP_EN below, and even an aborted one can leave a half-written image.  The proof
	 * has to be re-earned with `wifi ver` afterwards, rather than a stale "it is wio-n4"
	 * surviving a downgrade to an image whose UART ring is 127 bytes, or -- the one that
	 * bites hardest -- a stale 6 Mbaud rate against a module that just rebooted at 2.
	 */
	rtl_link_force_quiesce();

	/* PD14 to a known-safe INPUT state up front, so the cleanup contract (PD14 is NEVER
	 * returned as a driven-low output) holds on EVERY path -- including the first abort
	 * below -- regardless of its state on entry.  An input / pull-up does not contend
	 * even if the RTL8720 is currently driving PA[7] as its LOG-UART TX. */
	dl_strap_release_input();

	/* Power the module OFF before driving the strap: if it were running, its PA[7]
	 * (LOG-UART TX) would be a live output and driving PD14 low against it would be a
	 * push-pull contention.  Off first eliminates that. */
	rtl8720_power(false);
	if (dl_wait_ms(100u, should_abort, ctx))
		return -4;                            /* aborted; PD14 is input (released above) */

