owhinata/wio-lite-ai/app/rtl8720_flash.c
	dl_strap_drive_low();                         /* PD14 low = download strap asserted */
	if (dl_wait_ms(400u, should_abort, ctx)) {    /* total off >= 500 ms */
		dl_strap_release_input();             /* never leave PD14 driven low */
		return -4;
	}

	/* Release reset: the ROM samples PA[7] (= PD14, low) and enters download mode.
	 * Hold PD14 low a brief, bounded time across/after the edge, then release it to an
	 * input BEFORE the ROM can drive PA[7] as its LOG-UART TX (Wio Terminal holds this
	 * strap low for 500 ms on the same module; our tens of ms is well within that).
	 * M1 on board #2: 2 ms is too short (strap not latched -> normal boot), ~20 ms
	 * latches -> download mode; callers default to 30 ms. */
	rtl8720_power(true);
	if (hold_us)
		udelay(hold_us);
	dl_strap_release_input();

	if (rtl8720_uart_open(RTL8720_UART_LOG, 115200u) != 0)
		return -1;                            /* PD14 already released to input above */

	if (dl_wait_ms(20u, should_abort, ctx)) {     /* let RE/TE + the ROM settle */
		rtl8720_uart_close();
		return -4;
	}
	return 0;
}

int rtl_dl_probe(int use_slip, uint32_t timeout_ms,
                 int (*should_abort)(void *), void *ctx,
                 struct rtl_dl_result *r)
{
	/* read-word 0x00082000: 0x31 + addr(u32 LE). */
	uint8_t cmd[5] = { RTL_DL_READ_WORD,
	                   (uint8_t)RTL_DL_PROBE_ADDR,
	                   (uint8_t)(RTL_DL_PROBE_ADDR >> 8),
	                   (uint8_t)(RTL_DL_PROBE_ADDR >> 16),
	                   (uint8_t)(RTL_DL_PROBE_ADDR >> 24) };
	uint8_t tx[16], dec[32], junk[64];
	const uint8_t *p;
	int txn, n, pn, i;

	memset(r, 0, sizeof(*r));
	r->slip = use_slip ? 1 : 0;

	/* Drop any stale RX (a normal-boot banner, if the strap did not latch) so the parse
	 * starts clean.  Bounded by the ring size (SPSC, no infinite spin). */
	while (rtl8720_uart_read(junk, sizeof(junk)) > 0u)
		;

	if (use_slip) {
		txn = slip_encode(cmd, (int)sizeof(cmd), tx, (int)sizeof(tx));
		if (txn < 0)
			return -1;
		rtl8720_uart_write(tx, (size_t)txn);
	} else {
		rtl8720_uart_write(cmd, sizeof(cmd));
	}

	n = dl_recv(r->raw, (int)sizeof(r->raw), timeout_ms, should_abort, ctx);
	r->overflows = rtl8720_uart_overflows();
	if (n < 0)
		return -4;                            /* aborted */
	r->raw_len = n;

	/* Parse for the framed reply 0x31 <4 data> 0x15 (after SLIP-decode if used). */
	if (use_slip) {
		pn = slip_decode(r->raw, n, dec, (int)sizeof(dec));
		p = dec;
	} else {
		pn = n;
		p = r->raw;
	}
	for (i = 0; i + 6 <= pn; i++) {
		if (p[i] == RTL_DL_READ_WORD && p[i + 5] == RTL_DL_STATUS_OK) {
			r->entered = 1;
			r->word = (uint32_t)p[i + 1] | ((uint32_t)p[i + 2] << 8) |
			          ((uint32_t)p[i + 3] << 16) | ((uint32_t)p[i + 4] << 24);
			break;
		}
	}
	return 0;
}

/* ================================================================== *
 *  M2: flashloader stub upload + flash READ (issue #19)
 *
 *  NON-DESTRUCTIVE: this section writes only the module SRAM (the flashloader stub at
 *  0x00082000) and READS flash (0x20).  It sends NO flash-erase (0x17) and NO flash
 *  block-write.  The block-transfer helper (dl_send_sram) is private and refuses any
 *  destination outside the flashloader SRAM window, so no code path here can write flash.
 *  Protocol reference: pvvx SharpRTL872xTool Program.cs (cited per function).
 * ================================================================== */

/* Flashloader stub, embedded at build time from _ref/ambd/imgtool_flashloader_amebad.bin
 * (see CMakeLists.txt; the Realtek blob is not committed). */
extern const uint8_t  rtl8720_flashloader[];
extern const uint32_t rtl8720_flashloader_len;

#define RTL_DL_ACK          0x06u
#define RTL_DL_CAN          0x18u
#define RTL_DL_SOH          0x01u   /* 128-byte block */
#define RTL_DL_STX          0x02u   /* 1024-byte block */
#define RTL_DL_EOT          0x04u
#define RTL_DL_XMD_START    0x07u
#define RTL_DL_SETBAUD      0x05u
#define RTL_DL_READFLASH    0x20u
#define RTL_DL_GETSTATUS    0x21u   /* M4: SPI status/ID read -- see dl_spi_read */
#define RTL_DL_CHKSUM       0x27u   /* M4: device-side checksum -- see rtl_dl_flash_chksum */
#define RTL_DL_STUB_ADDR    0x00082000u
#define RTL_DL_STUB_ENTRY   0x00082021u   /* read-word @STUB_ADDR when the stub is resident */
#define RTL_DL_BAUD_IDX_115200   0x0Du
#define RTL_DL_BAUD_IDX_1500000  0x18u

/* M3: flash erase/write bounds (destructive -- see rtl_dl_flash_program). */
#define RTL_DL_ERASE             0x17u
#define RTL_DL_FLASH_BASE        0x08000000u   /* a block's addr carries this base for flash */

/*
 * Flash range caps.  READ and WRITE are deliberately DIFFERENT (issue #19 M4):
 *
 *  - WRITE_MAX stays at the original conservative 2 MB.  Every destructive path
 *    (dl_erase_sectors / dl_send_flash / rtl_dl_flash_program) keeps exactly the
 *    bounds it had before M4 -- the chip may be smaller than we think, and a write
 *    that wrapped past the die onto the boot image would be unrecoverable.
 *  - READ_MAX is the protocol's own ceiling: the read/erase/checksum commands carry
 *    a 24-bit offset, so 16 MB is everything that is addressable at all.  Reads are
 *    harmless (a read past the die just wraps), and M4 has to read past 2 MB both to
 *    detect the real capacity by wrap and to back the whole chip up.
 */
#define RTL_DL_FLASH_READ_MAX    0x01000000u
#define RTL_DL_FLASH_WRITE_MAX   0x00200000u

/* Per-block ACK budgets for the block transfer (see dl_send_blocks). */
#define RTL_DL_ACK_MS_SRAM       1000u
#define RTL_DL_ACK_MS_FLASH      3000u

/* M5: an AmebaD km0_boot image starts with this signature -- gate 2 of
 * rtl_dl_flash_program(), so a non-firmware blob can never land at offset 0. */
const uint8_t rtl_dl_km0_magic[RTL_DL_KM0_MAGIC_LEN] = {
	0x99u, 0x99u, 0x96u, 0x96u, 0x3Fu, 0xCCu, 0x66u, 0xFCu
};

/* ---- the module's 0x27 digest, computed on our side (see rtl8720_flash.h) ---- */

void rtl_dl_digest_init(struct rtl_dl_digest *d)
{
	d->sum = 0u;
	d->acc = 0u;
	d->nacc = 0u;
}

