owhinata/wio-lite-ai/app/rtl8720_flash.c
void rtl_dl_digest_add(struct rtl_dl_digest *d, const uint8_t *p, uint32_t n)
{
	uint32_t i;

	/* Byte-wise because callers feed arbitrarily-sized slices (a YMODEM block, a
	 * flash read chunk); the word boundary is carried in acc/nacc across calls. */
	for (i = 0u; i < n; i++) {
		d->acc |= (uint32_t)p[i] << (8u * d->nacc);
		if (++d->nacc == 4u) {
			d->sum += d->acc;
			d->acc = 0u;
			d->nacc = 0u;
		}
	}
}

uint32_t rtl_dl_digest_value(const struct rtl_dl_digest *d)
{
	/* A trailing partial word (only possible on a non-multiple-of-4 range, which the
	 * 4 KB-aligned callers never produce) is folded in as the module would see it. */
	return (d->nacc == 0u) ? d->sum : d->sum + d->acc;
}

/* Read bytes, skipping any that are not @want, until @want is seen (WaitResp).
 * 0 = found, -1 = timeout, -2 = aborted. */
static int dl_wait_byte(uint8_t want, uint32_t timeout_ms, int (*ab)(void *), void *ctx)
{
	ULONG deadline = tx_time_get() + (ULONG)timeout_ms;
	uint8_t b;

	for (;;) {
		if (rtl8720_uart_read(&b, 1u) == 1u) {
			if (b == want)
				return 0;
			continue;
		}
		if (ab != NULL && ab(ctx))
			return -2;
		if ((int32_t)(tx_time_get() - deadline) >= 0)
			return -1;
		tx_thread_sleep(1);
	}
}

/* Read exactly @n bytes (ReadBytes).  0 ok, -1 timeout, -2 aborted. */
static int dl_read_exact(uint8_t *buf, uint32_t n, uint32_t timeout_ms,
                         int (*ab)(void *), void *ctx)
{
	ULONG deadline = tx_time_get() + (ULONG)timeout_ms;
	uint32_t got = 0u;

	while (got < n) {
		got += (uint32_t)rtl8720_uart_read(buf + got, (size_t)(n - got));
		if (got >= n)
			break;
		if (ab != NULL && ab(ctx))
			return -2;
		if ((int32_t)(tx_time_get() - deadline) >= 0)
			return -1;
		tx_thread_sleep(1);
	}
	return 0;
}

/* Send @cmd then wait for the ACK 0x06 (WriteCmd).  0 ok, -1 timeout, -2 aborted. */
static int dl_send_wait_ack(const uint8_t *cmd, uint32_t n, uint32_t timeout_ms,
                            int (*ab)(void *), void *ctx)
{
	rtl8720_uart_write(cmd, (size_t)n);
	return dl_wait_byte(RTL_DL_ACK, timeout_ms, ab, ctx);
}

/* Drain RX until it has been quiet for @quiet_ms (bounded by @max_ms).  Unlike an
 * instantaneous drain this also absorbs late chatter -- e.g. a flashloader still emitting
 * bytes just after a flash program completes -- and gives the flash a moment to settle,
 * so the NEXT command starts from a truly clean boundary.  Call it BEFORE sending a
 * command (never after, or it would eat the reply). */
static void dl_drain_quiet(uint32_t quiet_ms, uint32_t max_ms)
{
	uint8_t junk[64];
	ULONG start = tx_time_get();
	ULONG last  = start;

	for (;;) {
		if (rtl8720_uart_read(junk, sizeof(junk)) > 0u) {
			last = tx_time_get();
		} else {
			if ((int32_t)(tx_time_get() - last) >= (int32_t)quiet_ms)
				return;
			if ((int32_t)(tx_time_get() - start) >= (int32_t)max_ms)
				return;
			tx_thread_sleep(1);
		}
	}
}

/* read-word @addr (ReadRegs, Program.cs:603-641): 0x31 + addr(u32 LE) -> 0x31 + data + 0x15.
 * Reads exactly the framed reply (skip to the 0x31 echo, then 5 bytes).  Read-only.
 * 0 ok (*out set), negative on failure. */
static int dl_read_word(uint32_t addr, uint32_t *out, int (*ab)(void *), void *ctx)
{
	uint8_t cmd[5], rp[5];
	int rr;

	dl_drain_quiet(10u, 200u);              /* start from a clean, quiet boundary */
	cmd[0] = 0x31u;
	cmd[1] = (uint8_t)addr;        cmd[2] = (uint8_t)(addr >> 8);
	cmd[3] = (uint8_t)(addr >> 16); cmd[4] = (uint8_t)(addr >> 24);
	rtl8720_uart_write(cmd, sizeof(cmd));

	rr = dl_wait_byte(0x31u, 500u, ab, ctx);
	if (rr)
		return rr;                          /* -1 timeout / -2 aborted (propagate) */
	rr = dl_read_exact(rp, 5u, 500u, ab, ctx);
	if (rr)
		return rr;
	if (rp[4] != 0x15u)
		return -1;
	*out = (uint32_t)rp[0] | ((uint32_t)rp[1] << 8) |
	       ((uint32_t)rp[2] << 16) | ((uint32_t)rp[3] << 24);
	return 0;
}

/*
 * PRIVATE block-transfer core (SendXmodem, Program.cs:783-868): 0x07 -> blocks -> 0x04.
 * block = [cmd][seq][~seq][addr:4LE][data:N(0xFF pad)][csum], csum = (addr4+data) & 0xFF.
 * @addr32 is the full destination address of the FIRST byte (SRAM as-is, or flash with the
 * 0x08000000 base); each block uses addr32 + off.  Callers (dl_send_sram / dl_send_flash)
 * own the destination validation -- this core does none.  0 ok, -2 aborted, -3 no ACK.
 *
 * @ack_ms is the per-block ACK budget.  It is a parameter rather than a constant only so
 * the flash path can wait longer than the SRAM path for a slow page program (M5): the
 * block/ACK SEQUENCE ITSELF IS UNCHANGED from the M2/M3-proven code.
 *
 * DELIBERATELY NO RETRY, unlike the reference tool (Program.cs:399 passes retry=3).  A
 * resent block would be harmless to the flash -- every block carries its own destination
 * address, so re-programming identical bytes changes no cells -- but it is NOT harmless to
 * the protocol: dl_wait_byte() returns on the first ACK it sees, so an ACK that merely
 * arrived late would satisfy the retry, and every subsequent block would then be matched
 * against the previous block's ACK.  A whole program run is idempotent, so the recovery
 * for a lost ACK is to repeat the operation, not to patch it up mid-stream.  If real
 * hardware ever shows ACK timeouts at scale, add "dl_drain_quiet() then resend" as its
 * own reviewed change -- do not sneak it in here.
 */
static int dl_send_blocks(const uint8_t *data, uint32_t len, uint32_t addr32,
                          uint32_t ack_ms, int (*ab)(void *), void *ctx)
{
	static uint8_t pkt[3 + 4 + 1024 + 1];   /* function-static: off the 4 KB shell stack */
	uint8_t start = RTL_DL_XMD_START, eot = RTL_DL_EOT;
	uint32_t off = 0u;
	uint8_t seq = 1u;

	if (dl_send_wait_ack(&start, 1u, 500u, ab, ctx))
		return -2;

	while (off < len) {
		uint32_t rem  = len - off;
		uint32_t N    = (rem > 128u) ? 1024u : 128u;
		uint32_t take = (rem < N) ? rem : N;
		uint32_t addr = addr32 + off;
		uint32_t i, sum = 0u;
		int rr;

		pkt[0] = (rem > 128u) ? RTL_DL_STX : RTL_DL_SOH;
		pkt[1] = seq;
		pkt[2] = (uint8_t)(0xFFu - seq);
		pkt[3] = (uint8_t)addr;         pkt[4] = (uint8_t)(addr >> 8);
		pkt[5] = (uint8_t)(addr >> 16); pkt[6] = (uint8_t)(addr >> 24);
		for (i = 0u; i < N; i++)
			pkt[7 + i] = (i < take) ? data[off + i] : 0xFFu;
		for (i = 3u; i < 7u + N; i++)   /* csum over addr(4) + data(N) */
			sum += pkt[i];
		pkt[7 + N] = (uint8_t)(sum & 0xFFu);

		rr = dl_send_wait_ack(pkt, 7u + N + 1u, ack_ms, ab, ctx);
		if (rr)
			return (rr == -2) ? -2 : -3;
		seq = (uint8_t)(seq + 1u);
		off += take;
	}

	if (dl_send_wait_ack(&eot, 1u, 1000u, ab, ctx))
		return -2;
	return 0;
}

