owhinata/wio-lite-ai/app/rtl8720_flash.c
/* PRIVATE, SRAM-ONLY (M2): refuse any address but the flashloader SRAM window -- so this
 * path can never write flash.  0 ok, -1 bad args, else dl_send_blocks code. */
static int dl_send_sram(const uint8_t *data, uint32_t len, uint32_t sram_addr,
                        int (*ab)(void *), void *ctx)
{
	if (sram_addr != RTL_DL_STUB_ADDR)          /* only the flashloader SRAM window */
		return -1;
	if (len == 0u || len > 0x10000u)            /* the stub is ~4.7 KB */
		return -1;
	/* 1000 ms per block: the M2-proven budget, kept exactly as it was. */
	return dl_send_blocks(data, len, sram_addr, RTL_DL_ACK_MS_SRAM, ab, ctx);
}

/*
 * Central, overflow-safe range validator for every flash op (read / erase / write).
 * Requires @off and @len 4 KB-aligned, non-zero @len, and off + len <= @max (the last
 * check written as `len <= max - off` so it cannot wrap).  Returns 1 if OK.
 *
 * @max is passed in rather than hard-coded so the destructive callers keep the
 * conservative RTL_DL_FLASH_WRITE_MAX while reads may use RTL_DL_FLASH_READ_MAX --
 * every call site names its own ceiling, and a read cap can never widen a write.
 */
static int dl_flash_range_ok(uint32_t off, uint32_t len, uint32_t max)
{
	if ((off & 0xFFFu) != 0u || (len & 0xFFFu) != 0u || len == 0u)
		return 0;
	if (off >= max)
		return 0;
	if (len > max - off)                        /* overflow-safe off + len <= max */
		return 0;
	return 1;
}

/* PRIVATE flash block-write (M3): the block-transfer with the flash base OR'd into the
 * address.  Bounded by dl_flash_range_ok.  No public general flash-write API exists -- the
 * only caller is rtl_dl_flash_program, which adds the gates documented on it. */
static int dl_send_flash(const uint8_t *data, uint32_t len, uint32_t flash_off,
                         int (*ab)(void *), void *ctx)
{
	if (!dl_flash_range_ok(flash_off, len, RTL_DL_FLASH_WRITE_MAX))
		return -1;
	/* 3000 ms per block rather than the SRAM path's 1000 ms: M3 only ever programmed
	 * 4 KB (4 blocks), so a slow page program part-way through a megabyte-scale image
	 * is untested territory and there is no retry to fall back on. */
	return dl_send_blocks(data, len, (flash_off & 0x00FFFFFFu) | RTL_DL_FLASH_BASE,
	                      RTL_DL_ACK_MS_FLASH, ab, ctx);
}

/* PRIVATE flash erase (M3, EraseSectorsFlash Program.cs:371-398): one 0x17 command per 4 KB
 * sector.  Bounded by dl_flash_range_ok.  0 ok, -1 bad args, -2 aborted / no ACK. */
static int dl_erase_sectors(uint32_t offset, uint32_t nsectors, int (*ab)(void *), void *ctx)
{
	uint32_t i;

	if (nsectors == 0u || nsectors > 0x10000u)          /* bound the multiply below */
		return -1;
	if (!dl_flash_range_ok(offset, nsectors * 4096u, RTL_DL_FLASH_WRITE_MAX))
		return -1;
	for (i = 0u; i < nsectors; i++) {
		uint32_t off = offset + i * 4096u;
		uint8_t pkt[6];

		pkt[0] = RTL_DL_ERASE;
		pkt[1] = (uint8_t)off; pkt[2] = (uint8_t)(off >> 8); pkt[3] = (uint8_t)(off >> 16);
		pkt[4] = 0x01u; pkt[5] = 0x00u;                 /* count = 1 (u16 LE) */
		if (dl_send_wait_ack(pkt, sizeof(pkt), 2000u, ab, ctx))
			return -2;
	}
	return 0;
}

int rtl_dl_set_baud(uint32_t baud)
{
	uint8_t pkt[2];

	pkt[0] = RTL_DL_SETBAUD;
	if (baud == 115200u)
		pkt[1] = RTL_DL_BAUD_IDX_115200;
	else if (baud == 1500000u)
		pkt[1] = RTL_DL_BAUD_IDX_1500000;
	else
		return -1;                          /* only-board policy: 115200 / 1500000 only */

	/* The ACK comes back at the OLD baud, so wait for it before reopening at the new baud. */
	if (dl_send_wait_ack(pkt, 2u, 500u, NULL, NULL))
		return -2;
	if (rtl8720_uart_open(RTL8720_UART_LOG, baud) != 0)
		return -3;
	return 0;
}

int rtl_dl_load_flashloader(uint32_t target_baud, int (*ab)(void *), void *ctx)
{
	uint32_t word = 0u;
	int rc;

	if (target_baud != 115200u && target_baud != 1500000u)
		return -1;

	/* Raise to the working baud.  Skip when the target is 115200: we entered download at
	 * 115200 and the ROM does not ACK a same-baud set (pvvx omits it too). */
	if (target_baud != 115200u && rtl_dl_set_baud(target_baud))
		return -2;

	rc = dl_read_word(RTL_DL_STUB_ADDR, &word, ab, ctx);
	if (rc == -2)
		return -7;                              /* aborted */
	if (rc == 0 && word == RTL_DL_STUB_ENTRY)
		return 0;                               /* stub already resident */

	/* Upload the stub to SRAM (writes SRAM only), then it reboots to 115200. */
	if (dl_send_sram(rtl8720_flashloader, rtl8720_flashloader_len, RTL_DL_STUB_ADDR, ab, ctx))
		return -3;
	if (rtl8720_uart_open(RTL8720_UART_LOG, 115200u) != 0)
		return -4;
	tx_thread_sleep(50);                            /* let the stub boot + re-init its UART */
	if (target_baud != 115200u && rtl_dl_set_baud(target_baud))
		return -5;

	rc = dl_read_word(RTL_DL_STUB_ADDR, &word, ab, ctx);
	if (rc == -2)
		return -7;
	if (rc != 0 || word != RTL_DL_STUB_ENTRY)
		return -6;                              /* stub did not come up resident */
	return 0;
}

/* ================================================================== *
 *  M4: capacity detection + device checksum + SPI status/ID (issue #19)
 *
 *  READ-ONLY.  Nothing here erases or writes flash: the only commands issued are
 *  0x20 (block read, already proven in M2), 0x21 (SPI status/ID read) and 0x27
 *  (device-side checksum).  The 0x21 SPI opcodes used (0x05/0x35/0x15 RDSR1..3 and
 *  0x9F RDID) are all read-only opcodes, so even a mis-framed 0x21 cannot modify
 *  flash -- the worst case is a garbage reply.
 * ================================================================== */

/*
 * SPI status/ID read (0x21, GetFlashStatus Program.cs:426-455): [0x21][opcode][n]
 * -> ACK byte 0x21 -> @n bytes.
 *
 * CONFIDENCE: the reference tool only ever issues this with n == 1 and opcode
 * 0x05/0x35/0x15 (RDSR1/2/3), so ONLY that shape is confirmed.  Whether byte 2 is a
 * raw SPI opcode (making 0x9F/RDID work) and whether byte 3 is really a length are
 * NOT established by the reference -- callers must treat anything else as an
 * experimental probe whose failure ends the session (see rtl_dl_flash_jedec).
 * 0 ok, -1 timeout / no ACK, -2 aborted.
 */
static int dl_spi_read(uint8_t opcode, uint8_t *out, uint32_t n,
                       int (*ab)(void *), void *ctx)
{
	uint8_t pkt[3];
	int rr;

