owhinata/wio-lite-ai/app/rtl8720_flash.c
	if (n == 0u || n > 8u)
		return -1;
	dl_drain_quiet(10u, 200u);              /* start from a clean, quiet boundary */
	pkt[0] = RTL_DL_GETSTATUS;
	pkt[1] = opcode;
	pkt[2] = (uint8_t)n;
	rtl8720_uart_write(pkt, sizeof(pkt));

	rr = dl_wait_byte(RTL_DL_GETSTATUS, 500u, ab, ctx);   /* the command byte is the ACK */
	if (rr)
		return rr;
	return dl_read_exact(out, n, 500u, ab, ctx);
}

int rtl_dl_flash_chksum(uint32_t off, uint32_t len, uint32_t timeout_ms, uint32_t *out,
                        int (*ab)(void *), void *ctx)
{
	uint8_t pkt[7], rp[4];
	int rr;

	if (out == NULL)
		return -1;
	/* Same 4 KB-aligned, overflow-safe bounds as a read: this only reads flash. */
	if (!dl_flash_range_ok(off, len, RTL_DL_FLASH_READ_MAX))
		return -1;

	dl_drain_quiet(10u, 200u);
	pkt[0] = RTL_DL_CHKSUM;
	pkt[1] = (uint8_t)off;  pkt[2] = (uint8_t)(off >> 8);  pkt[3] = (uint8_t)(off >> 16);
	pkt[4] = (uint8_t)len;  pkt[5] = (uint8_t)(len >> 8);  pkt[6] = (uint8_t)(len >> 16);
	rtl8720_uart_write(pkt, sizeof(pkt));

	/* The module reads the whole range before replying, so @timeout_ms must cover a
	 * full-chip digest.  A timeout here POISONS THE SESSION: the reply may still land
	 * later and would desynchronise the next command (dl_drain_quiet only absorbs
	 * 200 ms of late chatter), so callers must treat a non-zero return as "stop using
	 * this flashloader session" -- close the UART and reset the module. */
	rr = dl_wait_byte(RTL_DL_CHKSUM, timeout_ms, ab, ctx);
	if (rr)
		return rr;
	rr = dl_read_exact(rp, sizeof(rp), 1000u, ab, ctx);
	if (rr)
		return rr;
	*out = (uint32_t)rp[0] | ((uint32_t)rp[1] << 8) |
	       ((uint32_t)rp[2] << 16) | ((uint32_t)rp[3] << 24);
	return 0;
}

int rtl_dl_flash_status(uint8_t sr[3], int (*ab)(void *), void *ctx)
{
	/* The reference tool's exact usage: one status register per command, one byte back
	 * (Program.cs:426-455).  This shape is confirmed, so it is safe mid-session -- it is
	 * deliberately kept SEPARATE from the experimental RDID probe below, so a caller can
	 * read the status registers without risking a desynchronising guess. */
	static const uint8_t sr_op[3] = { 0x05u, 0x35u, 0x15u };
	int i;

	if (sr == NULL)
		return -1;
	for (i = 0; i < 3; i++)
		if (dl_spi_read(sr_op[i], &sr[i], 1u, ab, ctx) != 0)
			return -2;
	return 0;
}

int rtl_dl_flash_jedec(struct rtl_dl_jedec *j, int (*ab)(void *), void *ctx)
{
	uint8_t b;

	if (j == NULL)
		return -1;
	memset(j, 0, sizeof(*j));

	/*
	 * EXPERIMENTAL (see the header): RDID assumes byte 2 of the 0x21 command is a raw
	 * SPI opcode and byte 3 a read length -- neither is established by the reference
	 * tool.  Ask for one byte (the manufacturer ID) first; only if that looks real ask
	 * for the full three, and keep the answer only when the two agree, so a wrong guess
	 * about the command shape leaves j->ok == 0 instead of fabricating an ID.  Any exit
	 * from here may leave the link desynchronised, which is why the caller must give
	 * this probe a session of its own and end that session afterwards.
	 */
	if (dl_spi_read(0x9Fu, &b, 1u, ab, ctx) != 0)
		return -2;                      /* the link did not answer at all */
	if (b == 0x00u || b == 0xFFu)
		return 0;                       /* not a plausible manufacturer ID */
	if (dl_spi_read(0x9Fu, j->id, 3u, ab, ctx) != 0)
		return 0;
	if (j->id[0] != b)
		return 0;                       /* n==3 not honoured / inconsistent -> discard */
	j->ok = 1;
	/* Capacity byte: JEDEC encodes it as log2(bytes), e.g. 0x15 = 2 MB, 0x16 = 4 MB. */
	if (j->id[2] >= 0x10u && j->id[2] <= 0x19u)
		j->size = 1u << j->id[2];
	return 0;
}

int rtl_dl_detect_size(struct rtl_dl_size *s, int (*ab)(void *), void *ctx)
{
	/* Two reference sectors (8 KB) read in ONE command, plus the candidate's 8 KB.
	 * Function-static: off the 4 KB shell stack. */
	static uint8_t ref[RTL_DL_SIZE_PROBE_LEN];
	static uint8_t cand[RTL_DL_SIZE_PROBE_LEN];
	static const uint32_t cands[] = {
		0x00100000u, 0x00200000u, 0x00400000u, 0x00800000u,
	};
	uint32_t i;
	int rc, all_ff;

	if (s == NULL)
		return -1;
	memset(s, 0, sizeof(s[0]));

	/* Reference: the first 8 KB.  It must NOT be blank, or every candidate on a blank
	 * chip would "match" and we would report the smallest size.  The module's km0_boot
	 * lives here (verified on hardware in M2), so this is data in practice. */
	rc = rtl_dl_read_flash(0u, RTL_DL_SIZE_PROBE_LEN / 4096u, ref, sizeof(ref), ab, ctx);
	if (rc < (int)sizeof(ref))
		return -2;
	all_ff = 1;
	for (i = 0u; i < sizeof(ref); i++)
		if (ref[i] != 0xFFu) { all_ff = 0; break; }
	if (all_ff) {
		s->blank = 1;
		return -3;                      /* indeterminate: nothing to match against */
	}

	/*
	 * Wrap detection: a serial flash ignores the address bits above its capacity, so
	 * reading at `cap` returns offset 0 again.  Walk the candidates smallest-first and
	 * take the first full 8 KB match -- full compare, not a hash, so there is no
	 * collision argument to make.  Reading a candidate beyond the die is harmless.
	 */
	for (i = 0u; i < sizeof(cands) / sizeof(cands[0]); i++) {
		rc = rtl_dl_read_flash(cands[i], RTL_DL_SIZE_PROBE_LEN / 4096u,
		                       cand, sizeof(cand), ab, ctx);
		if (rc < (int)sizeof(cand))
			return -2;
		s->probed = i + 1u;
		if (memcmp(ref, cand, sizeof(ref)) == 0) {
			s->size = cands[i];
			return 0;
		}
	}
	return 0;                               /* no wrap seen: size stays 0 = unknown */
}

int rtl_dl_read_flash(uint32_t offset, uint32_t nsectors, uint8_t *buf, uint32_t buf_cap,
                      int (*ab)(void *), void *ctx)
{
	static uint8_t blk[2 + 1024 + 1];   /* seq + ~seq + 1024 data + csum (off the stack) */
	uint8_t hdr[6];
	uint32_t total_blocks, i, copied = 0u;

	if (nsectors == 0u || nsectors > 0x10000u)             /* bound the multiply */
		return -1;
	/* READ_MAX (16 MB) rather than the destructive cap: reads are harmless, and M4's
	 * wrap-based capacity detection + full-chip backup both need to read past 2 MB.
	 * The range check also keeps nsectors <= 0x1000, so it always fits the u16 count
	 * field in the command header below. */
	if (!dl_flash_range_ok(offset, nsectors * 4096u, RTL_DL_FLASH_READ_MAX))
		return -1;
	total_blocks = nsectors * 4u;                          /* module streams 4 x 1024 / sector */

	dl_drain_quiet(10u, 200u);                             /* clean, quiet boundary */
	hdr[0] = RTL_DL_READFLASH;
	hdr[1] = (uint8_t)offset;  hdr[2] = (uint8_t)(offset >> 8);  hdr[3] = (uint8_t)(offset >> 16);
	hdr[4] = (uint8_t)nsectors; hdr[5] = (uint8_t)(nsectors >> 8);
	rtl8720_uart_write(hdr, sizeof(hdr));

	for (i = 0u; i < total_blocks; i++) {
		uint32_t j, sum = 0u, chunk;

		if (dl_wait_byte(RTL_DL_STX, 2000u, ab, ctx))          /* 0x02 block header */
			return -2;
		if (dl_read_exact(blk, 2u + 1024u + 1u, 2000u, ab, ctx))  /* seq,~seq,1024,csum */
			return -2;
		if (blk[0] != (uint8_t)((i + 1u) & 0xFFu) ||
		    blk[1] != (uint8_t)(blk[0] ^ 0xFFu))
			return -3;                                     /* bad block sequence */
		for (j = 0u; j < 1024u; j++)
			sum += blk[2 + j];
		if ((uint8_t)(sum & 0xFFu) != blk[2 + 1024u]) {
			uint8_t can = RTL_DL_CAN;
			rtl8720_uart_write(&can, 1u);                  /* abort the stream */
			return -3;
		}

		if (copied < buf_cap && buf != NULL) {                 /* keep leading buf_cap bytes */
			chunk = buf_cap - copied;
			if (chunk > 1024u)
				chunk = 1024u;
			memcpy(buf + copied, blk + 2, chunk);
			copied += chunk;
		}

		if (i + 1u < total_blocks) {
			uint8_t ack = RTL_DL_ACK;
			rtl8720_uart_write(&ack, 1u);                  /* continue: bare ACK, no wait */
		} else {
			uint8_t can = RTL_DL_CAN;                       /* last block: CAN, wait its ACK */
			if (dl_send_wait_ack(&can, 1u, 1000u, ab, ctx))
				return -2;
		}
	}
	return (int)copied;
}

/* ------------------------------------------------------------------ *
 *  M5: program a host-supplied firmware image (the real write path)
 * ------------------------------------------------------------------ */

