owhinata/wio-lite-ai/app/rtl8720_flash.c
/* How long to allow the module for its 0x27 digest over @len bytes.  It reads the
 * whole range before answering (M4 measured ~30 s for the full 2 MB), so scale with
 * the size and keep a floor for small ranges. */
static uint32_t dl_chksum_budget_ms(uint32_t len)
{
	uint32_t ms = 10000u + (len >> 6);      /* 2 MB -> ~42 s */

	return (ms > 120000u) ? 120000u : ms;
}

int rtl_dl_flash_program(uint32_t offset, const uint8_t *data, uint32_t len,
                         uint32_t hold_us, struct rtl_dl_program *r,
                         int (*ab)(void *), void *ctx)
{
	struct rtl_dl_digest dg;
	struct rtl_dl_size   sz;
	int                  rc;

	memset(r, 0, sizeof(*r));
	if (data == NULL)
		return -1;

	/* Gate 1: the same central, overflow-safe validator every destructive path uses,
	 * against the conservative 2 MB write cap (NOT the wider read cap). */
	if (!dl_flash_range_ok(offset, len, RTL_DL_FLASH_WRITE_MAX))
		return -1;
	r->sectors = len / 4096u;

	/* Gate 2: refuse to put anything but an AmebaD boot image at offset 0. */
	if (offset == 0u &&
	    memcmp(data, rtl_dl_km0_magic, RTL_DL_KM0_MAGIC_LEN) != 0)
		return -3;

	/* Our digest of exactly the bytes we are about to write -- compared in phase 2
	 * against the module's own, so the verify needs no read-back. */
	rtl_dl_digest_init(&dg);
	rtl_dl_digest_add(&dg, data, len);
	r->host_sum = rtl_dl_digest_value(&dg);

	/* --- Phase 1: session, capacity, erase, write --- */
	if (rtl_dl_enter(hold_us, ab, ctx) != 0 ||
	    rtl_dl_load_flashloader(1500000u, ab, ctx) != 0)
		return -2;

	/*
	 * Gate 3: capacity, BEFORE erasing -- the wrap probe needs real data at offset 0 to
	 * match against, so it cannot run on a chip we have already blanked.
	 *
	 * A READ FAILURE HERE IS FATAL (rc == -2, which also covers a Ctrl+C abort): the
	 * link just failed to answer a read, and the very next thing this function would do
	 * is erase.  Never erase on the strength of a probe that did not work.
	 *
	 * The two "capacity not determined" outcomes are allowed through, because gate 1 has
	 * already bounded the write to 2 MB -- the capacity M4 measured on this board -- and
	 * refusing them would break the recovery path:
	 *   rc == -3  the first 8 KB is blank, so there is nothing to detect a wrap against.
	 *             THIS IS EXACTLY THE STATE A FAILED PROGRAM LEAVES BEHIND, and re-running
	 *             this function is how it is repaired.  Rejecting it would mean a botched
	 *             write could never be fixed.
	 *   size == 0 no wrap seen up to 8 MB, i.e. the chip is larger than anything we would
	 *             write anyway.
	 */
	rc = rtl_dl_detect_size(&sz, ab, ctx);
	if (rc == -2)
		return -10;                     /* probe failed; nothing erased */
	if (rc == 0 && sz.size != 0u) {
		r->cap_known = 1;
		r->cap = sz.size;
		if (offset >= sz.size || len > sz.size - offset)
			return -4;
	}

	if (dl_erase_sectors(offset, r->sectors, ab, ctx))
		return -5;
	r->erased = r->sectors;
	r->erase_ok = 1;

	if (dl_send_flash(data, len, offset, ab, ctx))
		return -6;
	r->written = len;
	r->write_ok = 1;

	/* --- Phase 2: the flashloader is wedged by the program (M3), so power-cycle,
	 * re-enter and ask the module to digest what it now holds. --- */
	if (rtl_dl_enter(hold_us, ab, ctx) != 0 ||
	    rtl_dl_load_flashloader(1500000u, ab, ctx) != 0)
		return -7;

	/* LAST operation of the session: a timeout here may still be answered later and
	 * would desynchronise anything that followed, so nothing does. */
	if (rtl_dl_flash_chksum(offset, len, dl_chksum_budget_ms(len), &r->dev_sum,
	                        ab, ctx) != 0)
		return -8;
	if (r->dev_sum != r->host_sum)
		return -9;
	r->verify_ok = 1;
	return 0;
}
